import json
 
# JSON字符串
json_string =  "{\"1894207699412832257\": \"2025-02-28;农资;主粮;水稻矮壮素;需采购一批水稻用矮壮素，使用面积50亩。价格200元/50亩。交付时间2月28日前。;\", \"1895010252480303105\": \"2025-05-31;农业技术;主粮;水稻育种;需要水稻荆占1号育种技术，培育优良品种，产量高，抗病抗虫性好。;\", \"1879086235101626369\": \"2025-02-16;农产品;主粮;江汉大米;需求一批江汉大米，共2000斤，价格面议。;\", \"1894211261672968193\": \"2025-03-31;农资;主粮;购一批复合肥;采购一批速效复合肥，氮磷钾均衡型，用于水稻种植。种植面积300亩。价格500元。交货日期：3月20日。;\", \"1895027169463095297\": \"2025-06-30;农产品;主粮;购一批非转基因糯玉米;购一批非转基因糯玉米，2000斤，价格面议;\", \"1894210008138108930\": \"2025-03-31;农资;主粮;购600斤面粉;需采购600斤面粉，品质高，符合国标，今年生产的。收购价格3元每斤。交货日期3月8日前。地址：武汉市江夏区庙山好味道面馆。;\", \"1879084498642997249\": \"2025-02-15;农产品;主粮;江汉大米;修改后的描述;\", \"1895026155192307713\": \"2025-06-30;农产品;中药材;采购360斤三七;需采购一批三七，360-400斤，价格面议。交货时间4月5日前。;\", \"1895284274799562753\": \"2025-04-30;农资;蔬菜;需要一批蔬菜种子，香菜，小葱;采购一批蔬菜种子，品种有香菜、小葱、生菜、鸡毛菜。数量5斤左右，价格面议，急用。;\", \"1894200303386873858\": \"2025-03-31;农产品;水果;购200斤苹果;需求苹果200斤，品种不限，要求品相好，口感脆甜。价格面议。;\"}"
 
# 将JSON字符串转换为字典
data_dict = json.loads(json_string)

 
# 打印结果，查看转换后的字典
print(type(data_dict))
for key,value in data_dict.items():
    print("需求id为：",key)
    # 解析需求内容
    content = value.split(';')
    print('日期：'+content[0]+'\n需求类型:'+content[1]+'\n产业链类型:'+content[2]+'\n需求名称:'+content[3]+'\n需求描述:'+content[4])
    print('/n')
